[
  {
    "company":"PAiC Business Development",
    "year":"August, 2019 - September, 2022",
    "type":"International telecommunications and development company dedicated to provide Telco and development software service, with clients around the world with offices in America and Europe.",
    "url": "https://paic-chain.com/",
    "job": "Front-End Developer",
    "contributions":[
        "Managed and implementedof version control software in legacy projects that allow better control in updating products and creation of new features.",
        "Created new features and optimization code in legacy projects improving the performance by 30% of existing products.",
        "Migrated of legacy projects to new versions and refactored components that follow a more current standard to improve the performance of the products.",
        "Implementation of new development technologies like Laravel, Vue, and GraphQL to amplify the scope of solutions provided.",
        "Documented code and APIs using Postman and Swagger that allowed to have a solid knowledge of the RESTful API definition and the specification describing the capabilities of the project covering client and new developer concerns.",
        "Optimized code in new developments creating processes to implement and adopt best practices to meet industry standards and client requirements.",
        "Implement open-source technologies to achieve company e-commerce products ready to deploy with the requirements of the Central American market.",
        "Reduced bugs and errors reported for customers by 70%, incrementing the quality of the final product.",
        "Increased sales in 40% of customer companies like Sompopo Shop, developing features to improve UX/UI.",
        "Project Leader of 5 people team, in projects with regional scope.",
        "Contributed to take decisions in the design and development of new products.",
        "Supported team and coordinated new product developments, implementations, and releases.",
        "Oriented new members in the introduction to new projects."
      ]
  },
  {
    "company":"IdeaWorks International",
    "year":"May, 2018 - August, 2019",
    "type":"Multi-National Marketing Agency with scope regional in Central and South America dedicated to digital transformation of companies.",
    "url": "https://ideaworks.la/sv",
    "job": "Web developer / Lead Project",
    "contributions":[
      "Analyzed new opportunities to implement new development technologies and efficient work.",
      "Incursioned into new markets developing tech solutions for companies.",
      "Directioned and planification of new Web projects.",
      "Managed control and security of databases.",
      "Improved web design process by implementing technologies like Figma for Designers and SASS for developers.",
      "Implemented of web security process by using the authentication library Auth0 to improve security.",
      "Optimized UI/UX of web projects in collaboration with the creativity department.",
      "Created rules and good practice coding.",
      "Project Leader of 3 people team.",
      "Oriented and trained new developers."
     ]
  }
]